rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R') ORDER BY release_date
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "Daniel"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ? AND "movies"."rating" IN ('G', 'PG', 'PG-13', 'NC-17', 'R')  [["director", ""]]
---
  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:title => :asc}, 'hilite'
    when 'release_date'
      ordering,@date_header = {:release_date => :asc}, 'hilite'
    end
    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]
    end

    if params[:id]
      @movie = Movie.find(params[:id])
      @movies = @movie.find_director_movies()
      return
    end
    if params[:sort] != session[:sort] or params[:ratings] != session[:ratings]
      session[:sort] = sort
      session[:ratings] = @selected_ratings
      redirect_to :sort => sort, :ratings => @selected_ratings and return
    end

    @movies = Movie.where(rating: @selected_ratings.keys).order(ordering)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "Daniel"]]
---
  def find_director_movies
    movie = Movie.find params[:id]
    if movie.director.nil? or movie.director == ''
      flash[:warning] = "'#{movie.title}' has no director info"
      redirect_to movies_path
    else
      @movies = movie.find_director_movies

UPDATE "movies" SET "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["director", "Ridley Scott"], ["updated_at", "2016-10-08 19:30:23.526950"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)

DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]
---
  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy